08_RTD_openFoam/tundish_OF_V13/tundishFlow2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{


    walls
    {
        type            noSlip;
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            noSlip;
        value           uniform (0 0 0);
    }

    obstacle
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
    
    defaultFaces
    {
        type            empty;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.1);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
