08_RTD_openFoam/tundish_OF_V13/tundishFlow2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    top
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    obstacle
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    defaultFaces
    {
        type            empty;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

}


// ************************************************************************* //
