08_RTD_openFoam/tundish_OF_V13/tundishFlow2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32;
        startFace       2154;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          70;
        startFace       2186;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          70;
        startFace       2256;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2240;
        startFace       2326;
    }
)

// ************************************************************************* //
