08_RTD_openFoam/tundish_OF_V13/tundishFlow2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0 0.0 0.0) // 0
    (3.5 0.0 0.0) // 1
    (3.5 0.1 0.0) // 2    
    (0.0 0.1 0.0) // 3
    (0.0 0.0 0.8) // 4
    (3.5 0.0 0.8) // 5
    (3.5 0.1 0.8) // 6
    (0.0 0.1 0.8) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   // vertex numbers
    (70 1 16)              // number of cells in each direction
    simpleGrading (1 1 1)   // cell expansion ratios
);

edges
(
);

defaultPatch
{
    name frontAndBack;
    type empty;

}

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3) // back wall
            (1 2 6 5) // front wall 
        );
    }
    top
    {
        type wall;
        faces
        (
            (4 5 6 7) // top
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1) // bottom
        );
    }
);


// ************************************************************************* //