08_RTD_openFoam/tundish_OF_V13/tundishFlow2D/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pointSync false;

patches
(
    {
        name    inlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom   set;
        set     inlet;
    }
    {
        name    outlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom   set;
        set     outlet;
    }
);