08_RTD_openFoam/tundish_OF_V13/tundishFlow2D/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
fieldAverage1
{
    // Mandatory entries (unmodifiable)
    type            fieldAverage;
    libs            ("libfieldFunctionObjects.so");
    // Mandatory entries (runtime modifiable)
    fields
    (
        T
        {
            mean        yes;
            prime2Mean  no;
            base        banana;
        }
    );

    // Optional entries (runtime modifiable)
    restartOnRestart    false;
    restartOnOutput     false;
    periodicRestart     true;
    restartPeriod       5;
    
    // Optional (inherited) entries
    enabled         true;
    writeControl    writeTime;
}


surfaceAverageUOutlet
{
    // Mandatory entries (unmodifiable)
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");
    // Mandatory entries (runtime modifiable)
    fields          (U);
    operation       areaAverage;
    patch           outlet;
    // Optional entries (runtime modifiable)
    postOperation   none;
    weightField     phi;
    scaleFactor     1.0;
    writeArea       false;
    surfaceFormat   none;
    // Optional (inherited) entries
    writeFields     false;
    scalingFactor   1.0;
    writePrecision  8;
    writeToFile     true;
    //writeControl    writeTime;
    writeControl    timeStep;
    writeInterval   10;
}
